# Discussion 7

## Concatenate and Merge in Pandas

In [88]:
import numpy as np
import pandas as pd

__pd.concat( )__ concatenates or stacks together objects along an axis.

In [356]:
data1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                      'B': ['B0', 'B1', 'B2', 'B3'],
                      'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']},index=[0, 1, 2, 3])

In [357]:
data1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [360]:
data2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},index=[4, 5, 6, 7])

In [361]:
data2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [364]:
pd.concat([data1,data2],keys=['x', 'y'])

      A   B   C   D
x 0  A0  B0  C0  D0
  1  A1  B1  C1  D1
  2  A2  B2  C2  D2
  3  A3  B3  C3  D3
y 4  A4  B4  C4  D4
  5  A5  B5  C5  D5
  6  A6  B6  C6  D6
  7  A7  B7  C7  D7

In [372]:
pd.concat([data1,data2],keys=['x', 'y'],axis=1)

     x                   y
     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7

In [383]:
data3 = pd.DataFrame({'B': ['B3', 'B3', 'B3', 'B3'],
                      'C': ['C4', 'C4', 'C4', 'C4'],
                      'D': ['D5', 'D5', 'D5', 'D5'],
                      'E': ['E6', 'E6', 'E6', 'E6']},index=[3, 4, 5, 6])
data3

    B   C   D   E
3  B3  C4  D5  E6
4  B3  C4  D5  E6
5  B3  C4  D5  E6
6  B3  C4  D5  E6

In [386]:
pd.concat([data1,data3],keys=[1,2])

/Users/wangxiaodong/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

       A   B   C   D    E
1 0   A0  B0  C0  D0  NaN
  1   A1  B1  C1  D1  NaN
  2   A2  B2  C2  D2  NaN
  3   A3  B3  C3  D3  NaN
2 3  NaN  B3  C4  D5   E6
  4  NaN  B3  C4  D5   E6
  5  NaN  B3  C4  D5   E6
  6  NaN  B3  C4  D5   E6

In [387]:
pd.concat([data1,data3],keys=[1,2],join='inner')

      B   C   D
1 0  B0  C0  D0
  1  B1  C1  D1
  2  B2  C2  D2
  3  B3  C3  D3
2 3  B3  C4  D5
  4  B3  C4  D5
  5  B3  C4  D5
  6  B3  C4  D5

In [388]:
pd.concat([data1,data3],join='inner',ignore_index=True) # if the row index doesn't contain any information

    B   C   D
0  B0  C0  D0
1  B1  C1  D1
2  B2  C2  D2
3  B3  C3  D3
4  B3  C4  D5
5  B3  C4  D5
6  B3  C4  D5
7  B3  C4  D5

__pd.merge( )__ connects rows in DataFrames based on one or more keys. It is similar to SQL, as it implements database __join__ operations.

In [389]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [390]:
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                      'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']})
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [393]:
pd.merge(left, right, on='key1')

  key1 key2_x   A   B key2_y   C   D
0   K0     K0  A0  B0     K0  C0  D0
1   K0     K1  A1  B1     K0  C0  D0
2   K1     K0  A2  B2     K0  C1  D1
3   K1     K0  A2  B2     K0  C2  D2
4   K2     K1  A3  B3     K0  C3  D3

In [394]:
pd.merge(left, right, on=['key1','key2']) # merge with mutiple keys

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

__inner join__: keys in the result are the intersection or the common set found in both tables

In [399]:
pd.merge(left, right, on=['key1','key2'],how='inner') # inner join by default

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

__left join__: use all key combinations found in the left table

In [397]:
pd.merge(left, right, on=['key1','key2'],how='left') # left join

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

__right join__: use all key combinations found in the right table

In [398]:
pd.merge(left, right, on=['key1','key2'],how='right') # right join

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

__outer join__: takes the union set of the keys

In [400]:
pd.merge(left, right, on=['key1','key2'],how='outer') # outer join

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

#### more merge

In [404]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [408]:
right2 = pd.DataFrame({'C': ['K0', 'K1', 'K2', 'K2'],
                       'D': ['D0', 'D1', 'D2', 'D3'],
                       'E': ['E0', 'E1', 'E2', 'E3']},index=['K1','K2','K3','K4'])
right2

     C   D   E
K1  K0  D0  E0
K2  K1  D1  E1
K3  K2  D2  E2
K4  K2  D3  E3

In [409]:
pd.merge(left,right2,left_on='key1',right_on='C')

  key1 key2   A   B   C   D   E
0   K0   K0  A0  B0  K0  D0  E0
1   K0   K1  A1  B1  K0  D0  E0
2   K1   K0  A2  B2  K1  D1  E1
3   K2   K1  A3  B3  K2  D2  E2
4   K2   K1  A3  B3  K2  D3  E3

In [410]:
pd.merge(left,right2,left_on='key1',right_index=True) # merge on right index

  key1 key2   A   B   C   D   E
2   K1   K0  A2  B2  K0  D0  E0
3   K2   K1  A3  B3  K1  D1  E1

## Interacting with Databases

In a business setting, SQL-based relational databases(such as SQL Server, MySQL) are in wide use, and many alternative databases have become quite popular. The choice of database is usually dependent on the performance, data integrity, and scalability needs of an application.

Structured Query Language (SQL) is a language designed for accessing information in relational databases. SQL lets you access and manipulate databases.

### sqlite3

SQLite is possibly the most-used database engine in the world. SQLite's popularity is partly due to its reliability, easy setup, and broad range of features.

Python has built-in support for SQLite databases through the sqlite3 module.

In [1]:
import sqlite3

To connect to a database, use __sqlite3.connect( )__ function. This is similar to opening a file; you should close the database when you're done using it.

In [139]:
db = sqlite3.connect("mydata.sqlite")

In [140]:
db

To execute a SQL command, use the connection's .execute() method. This returns a cursor, which is a pointer to the results in the database.

In [122]:
cursor = db.execute("Create Table newtable (a Varchar(20), b Real, c Integer)")  # create a new table
cursor

In [123]:
data=[('A',1.2,1),('B',3.5,4),('C',5.6,3),('D',3.2,2)]

In [124]:
db.executemany("Insert Into newtable Values(?,?,?)",data)    # insert data into the table

In [142]:
db.execute("Insert Into newtable Values('E',7.1,4)")

In [149]:
cursor2=db.execute("Select * from newtable")  # selecte data from the table
cursor2

In [150]:
cursor2.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None))

To get the results from the database, use one of the cursor's fetch methods. The .fetchall() method returns all rows in the result.

In [127]:
selection=cursor2.fetchall()
selection

[('A', 1.2, 1), ('B', 3.5, 4), ('C', 5.6, 3), ('D', 3.2, 2), ('E', 7.1, 4)]

In [128]:
pd.DataFrame(selection,columns=['a','b','c'])

   a    b  c
0  A  1.2  1
1  B  3.5  4
2  C  5.6  3
3  D  3.2  2
4  E  7.1  4

In [145]:
db.execute("delete from newtable where a='E'") # delete a row where column a = 'E'

In [151]:
db.execute("Select * from newtable").fetchall()

[('A', 1.2, 1), ('B', 3.5, 4), ('C', 5.6, 3), ('D', 3.2, 2)]

In [129]:
db.execute("Create Table newtable2 AS SELECT * FROM newtable Where b>3") # create another new table based on the table

In [131]:
db.execute("Select * from newtable2").fetchall()

[('B', 3.5, 4), ('C', 5.6, 3), ('D', 3.2, 2), ('E', 7.1, 4)]

In [141]:
db.execute("Drop table newtable2")  # delete table newtable2

If you try to CREATE or DROP a table or index while a SELECT statement is still pending, it would show an error " Database Is Locked". One way to do is to commit and close the database.

In [135]:
# Save (commit) the changes
db.commit()

Don't forget to close the database when you're done!

In [137]:
db.close()

### Pandas

The easiest way to view database tables is to load them into a data frame with Pandas.

You still need to connect to the database first with sqlite3 or sqlalchemy.

The __pd.read_sql( )__ function takes a SQL query and an open database connection as arguments. The result of the query is returned as a data frame.

In [91]:
pd.read_sql("SELECT * FROM newtable", db)

   a    b  c
0  A  1.2  1
1  B  3.5  4
2  C  5.6  3
3  D  3.2  2
4  E  7.1  4

In [94]:
pd.read_sql("SELECT * FROM newtable limit 3", db)

   a    b  c
0  A  1.2  1
1  B  3.5  4
2  C  5.6  3

In [96]:
pd.read_sql("SELECT a,b FROM newtable", db)

   a    b
0  A  1.2
1  B  3.5
2  C  5.6
3  D  3.2
4  E  7.1

In [97]:
pd.read_sql("SELECT a,b FROM newtable where c>3", db)

   a    b
0  B  3.5
1  E  7.1

In [155]:
pd.read_sql("SELECT * FROM newtable order by c", db)

   a    b  c
0  A  1.2  1
1  D  3.2  2
2  C  5.6  3
3  B  3.5  4
4  E  7.1  4

In [187]:
pd.read_sql("SELECT a as First, b as Second FROM newtable where First='A' or a='C' ", db) # or

  First  Second
0     A     1.2
1     C     5.6

In [191]:
pd.read_sql("SELECT a as First, b as Second FROM newtable where (First='A' or First='E') and c=4 ", db) # and

  First  Second
0     E     7.1

In [164]:
pd.read_sql("SELECT a as First, b as Second FROM newtable where First in ('A','D','E')", db) # in

  First  Second
0     A     1.2
1     D     3.2
2     E     7.1

In [165]:
pd.read_sql("SELECT a as First, b as Second FROM newtable where b between 1 and 5", db) # between ... and ...

  First  Second
0     A     1.2
1     B     3.5
2     D     3.2

### Convert DataFrame to SQL format

In [318]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue','Kate','Tom'],
                    'department': ['Accounting', 'Engineering', 'Engineering', 'HR','Data Scientist','Data Scientist']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue','Tom'],
                    'hire_date': [2004, 2008, 2012, 2014,2013]})

In [319]:
df1.to_sql('df1',db)

In [320]:
df2.to_sql('df2',db)

In [321]:
pd.read_sql("select * from df1",db)

   index employee      department
0      0      Bob      Accounting
1      1     Jake     Engineering
2      2     Lisa     Engineering
3      3      Sue              HR
4      4     Kate  Data Scientist
5      5      Tom  Data Scientist

In [322]:
pd.read_sql("select * from df2",db)

   index employee  hire_date
0      0     Lisa       2004
1      1      Bob       2008
2      2     Jake       2012
3      3      Sue       2014
4      4      Tom       2013

In [323]:
pd.read_sql("select * from df1 where employee like 'J%' ",db)

   index employee   department
0      1     Jake  Engineering

In [324]:
pd.read_sql("select * from df1 where employee like '%e' ",db)

   index employee      department
0      1     Jake     Engineering
1      3      Sue              HR
2      4     Kate  Data Scientist

In [325]:
pd.read_sql("select * from df1 where employee like 'B_b' ",db)

   index employee  department
0      0      Bob  Accounting

### Inner Join and Left Join

In Pandas, right and full join are not supported right now.

In [326]:
pd.read_sql("select * from df1 inner join df2 on df1.employee=df2.employee ",db)

   index employee      department  index employee  hire_date
0      0      Bob      Accounting      1      Bob       2008
1      1     Jake     Engineering      2     Jake       2012
2      2     Lisa     Engineering      0     Lisa       2004
3      3      Sue              HR      3      Sue       2014
4      5      Tom  Data Scientist      4      Tom       2013

In [327]:
pd.read_sql("select df1.*,df2.hire_date from df1 inner join df2 on df1.employee=df2.employee ",db)

   index employee      department  hire_date
0      0      Bob      Accounting       2008
1      1     Jake     Engineering       2012
2      2     Lisa     Engineering       2004
3      3      Sue              HR       2014
4      5      Tom  Data Scientist       2013

In [328]:
pd.read_sql(
    "select t1.*,t2.hire_date from df1 AS t1 "
    "inner join df2 AS t2 on t1.employee=t2.employee"
            ,db) # rename table df1 as t1, table df2 as t2

   index employee      department  hire_date
0      0      Bob      Accounting       2008
1      1     Jake     Engineering       2012
2      2     Lisa     Engineering       2004
3      3      Sue              HR       2014
4      5      Tom  Data Scientist       2013

In [329]:
pd.read_sql(
'''
select t1.*,t2.hire_date from df1 AS t1
left join df2 AS t2 on t1.employee=t2.employee

''',db)

   index employee      department  hire_date
0      0      Bob      Accounting     2008.0
1      1     Jake     Engineering     2012.0
2      2     Lisa     Engineering     2004.0
3      3      Sue              HR     2014.0
4      4     Kate  Data Scientist        NaN
5      5      Tom  Data Scientist     2013.0

In [330]:
pd.read_sql(
'''
select t1.*,t2.hire_date from df1 AS t1
left join df2 AS t2 on t1.employee=t2.employee
where hire_date isnull
''',db)

   index employee      department hire_date
0      4     Kate  Data Scientist      None

#### Aggregation functions

In [331]:
pd.read_sql("select * from df1",db) # df1 agian

   index employee      department
0      0      Bob      Accounting
1      1     Jake     Engineering
2      2     Lisa     Engineering
3      3      Sue              HR
4      4     Kate  Data Scientist
5      5      Tom  Data Scientist

In [332]:
pd.read_sql("select count(*) as Count from df1",db)

   Count
0      6

In [333]:
pd.read_sql("select count(distinct department) as unique_department from df1",db)

   unique_department
0                  4

In [334]:

df3 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue','Kate','Tom'],
                   'payrate': [40,55,50,35,50,52]})
df3

  employee  payrate
0      Bob       40
1     Jake       55
2     Lisa       50
3      Sue       35
4     Kate       50
5      Tom       52

In [335]:
df3.to_sql('df3',db)

In [337]:
# sub-query
pd.read_sql(
'''
select table1_2.employee,table1_2.department,table1_2.hire_date,payrate from df3 inner join

(select df1.*,df2.hire_date from df1
left join df2 on df1.employee=df2.employee) as table1_2

on table1_2.employee=df3.employee

''',db)

  employee      department  hire_date  payrate
0      Bob      Accounting     2008.0       40
1     Jake     Engineering     2012.0       55
2     Lisa     Engineering     2004.0       50
3      Sue              HR     2014.0       35
4     Kate  Data Scientist        NaN       50
5      Tom  Data Scientist     2013.0       52

#### group by

In [345]:
# select a department, No. of people in it and the average payrate
pd.read_sql(
'''
select department,count(*) as num_of_people,avg(payrate) as average_payrate from df1
left join df3 on df1.employee=df3.employee
group by department
''',db)

       department  num_of_people  average_payrate
0      Accounting              1             40.0
1  Data Scientist              2             51.0
2     Engineering              2             52.5
3              HR              1             35.0

In [351]:
# select a department where the average payrate is greater than 50 and show its total payrate number
# group by... having... 
# "having' is similar to 'where', but 'where' cannot be used with aggregation functions
pd.read_sql(
'''
select department,sum(payrate) as sum_payrate from df1
left join df3 on df1.employee=df3.employee
group by department
having avg(payrate) > 50

''',db)

       department  sum_payrate
0  Data Scientist          102
1     Engineering          105

__example__: find the shortest distance between 2 points in table point. Assume every point is unique.

In [431]:
point = pd.DataFrame({'x': [-1,0,7,8,3]},index=[0,1,2,3,4])

In [417]:
point.to_sql('point',db)

In [430]:
pd.read_sql("select * from point",db) # show table point

   index  x
0      0 -1
1      1  0
2      2  7
3      3  8
4      4  3

In [425]:
pd.read_sql(
'''
select A.x,B.x from point as A join point as B
on A.x!=B.x
''',db)

    x  x
0  -1  0
1  -1  7
2  -1  8
3  -1  3
4   0 -1
5   0  7
6   0  8
7   0  3
8   7 -1
9   7  0
10  7  8
11  7  3
12  8 -1
13  8  0
14  8  7
15  8  3
16  3 -1
17  3  0
18  3  7
19  3  8

In [428]:
pd.read_sql(
'''
select min(abs(A.x-B.x)) as shortest from point as A join point as B
on A.x!=B.x
''',db)

   shortest
0         1